"""
Дан список my_list = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89], выведите все элементы, которые меньше 5.
"""


my_list = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
result = 0

for x in my_list:
    if x < 5:
        print(x)
