"""
Создать список состоящий из отдельных единичных символов, преобразовать список в строку, инвертировать строку и вывести на печать.
"""

    my_list = ["s", "t", "r", "i", "n", "g"]
    my_str = "".join(my_spis)
    print(my_str[::-1])
